---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.FlexDuct.FlexDuctType
source: html/67ccc28b-dcf5-aa69-44c1-5a4da62e260a.htm
---
# Autodesk.Revit.DB.Mechanical.FlexDuct.FlexDuctType Property

The flex duct type of this flex duct.

## Syntax (C#)
```csharp
public FlexDuctType FlexDuctType { get; set; }
```